name: "VGG_ILSVRC_16_layers"
input: "data" input_shape { dim: 1 dim: 3 dim: 224 dim: 224 }
input: "rois" input_shape { dim: 1 dim: 5 }
input: "roi_scores" input_shape { dim: 1 }

#-------------------------------------------------------------------------------------------------
layer { name: "conv1_1" type: "Convolution" bottom: "data" top: "conv1_1"
	convolution_param { num_output: 64 pad: 1 kernel_size: 3 }}
layer {	name: "relu1_1" type: "ReLU" bottom: "conv1_1" top: "conv1_1" }
layer { name: "conv1_2" type: "Convolution" bottom: "conv1_1" top: "conv1_2"
	convolution_param { num_output: 64 pad: 1 kernel_size: 3 }}
layer { name: "relu1_2" type: "ReLU" bottom: "conv1_2" top: "conv1_2" }
layer { name: "pool1" type: "Pooling" bottom: "conv1_2" top: "pool1" pooling_param { pool: MAX kernel_size: 2 stride: 2 }}
layer { name: "conv2_1" type: "Convolution" bottom: "pool1" top: "conv2_1"
	convolution_param { num_output: 128 pad: 1 kernel_size: 3 }}
layer { name: "relu2_1" type: "ReLU" bottom: "conv2_1" top: "conv2_1" }
layer { name: "conv2_2" type: "Convolution" bottom: "conv2_1" top: "conv2_2"
	convolution_param { num_output: 128 pad: 1 kernel_size: 3 }}
layer { name: "relu2_2" type: "ReLU" bottom: "conv2_2" top: "conv2_2" }
layer { name: "pool2" type: "Pooling" bottom: "conv2_2" top: "pool2" pooling_param { pool: MAX kernel_size: 2 stride: 2 }}
layer { name: "conv3_1" type: "Convolution" bottom: "pool2" top: "conv3_1"
	convolution_param { num_output: 256 pad: 1 kernel_size: 3 }}
layer { name: "relu3_1" type: "ReLU" bottom: "conv3_1" top: "conv3_1" }
layer { name: "conv3_2" type: "Convolution" bottom: "conv3_1" top: "conv3_2"
	convolution_param { num_output: 256 pad: 1 kernel_size: 3 }}
layer { name: "relu3_2" type: "ReLU" bottom: "conv3_2" top: "conv3_2" }
layer { name: "conv3_3" type: "Convolution" bottom: "conv3_2" top: "conv3_3"
	convolution_param { num_output: 256 pad: 1 kernel_size: 3 }}
layer { name: "relu3_3" type: "ReLU" bottom: "conv3_3" top: "conv3_3" }
layer { name: "pool3" type: "Pooling" bottom: "conv3_3" top: "pool3" pooling_param { pool: MAX kernel_size: 2 stride: 2 }}
layer { name: "conv4_1" type: "Convolution" bottom: "pool3" top: "conv4_1"
	convolution_param { num_output: 512  pad: 1 kernel_size: 3 }}
layer { name: "relu4_1" type: "ReLU" bottom: "conv4_1" top: "conv4_1" }
layer { name: "conv4_2" type: "Convolution" bottom: "conv4_1" top: "conv4_2"
	convolution_param { num_output: 512 pad: 1 kernel_size: 3 }}
layer { name: "relu4_2" type: "ReLU" bottom: "conv4_2" top: "conv4_2" }
layer { name: "conv4_3" type: "Convolution" bottom: "conv4_2" top: "conv4_3"
	convolution_param { num_output: 512 pad: 1 kernel_size: 3 }}
layer { name: "relu4_3" type: "ReLU" bottom: "conv4_3" top: "conv4_3" }
layer { name: "pool4" type: "Pooling" bottom: "conv4_3" top: "pool4" pooling_param { pool: MAX kernel_size: 2 stride: 2 }}
layer { name: "conv5_1" type: "Convolution" bottom: "pool4" top: "conv5_1"
	convolution_param { num_output: 512 pad: 1 kernel_size: 3 }}
layer { name: "relu5_1" type: "ReLU" bottom: "conv5_1" top: "conv5_1" }
layer { name: "conv5_2" type: "Convolution" bottom: "conv5_1" top: "conv5_2"
	convolution_param { num_output: 512 pad: 1 kernel_size: 3 }}
layer { name: "relu5_2" type: "ReLU" bottom: "conv5_2" top: "conv5_2" }
layer { name: "conv5_3" type: "Convolution" bottom: "conv5_2" top: "conv5_3"
	convolution_param { num_output: 512 pad: 1 kernel_size: 3 }}
layer { name: "relu5_3" type: "ReLU" bottom: "conv5_3" top: "conv5_3" }
#-------------------------------------------------------------------------------------------------

#------------------------------------ROI POOLING--------------------------------------------------
layer { name: "roi_pool_conv5" type: "ROIPooling" bottom: "conv5_3" bottom: "rois" top: "roi_pool_conv5"
	roi_pooling_param { pooled_w: 7 pooled_h: 7 spatial_scale: 0.0625 }}

#------------------------------------ROI SCORE BOOSTING--------------------------------------------
layer { name: "boost" type: "Scale" bottom: "roi_pool_conv5" bottom: "roi_scores" top: "boost"
	scale_param { axis: 0 }}

#-----------------------------------MAIN STREAM---------------------------------------------------------------
#-------------------------------------FC----------------------------------------------------------
layer { name: "fc6_1" type: "InnerProduct" bottom: "boost" top: "fc6_1"
	inner_product_param { num_output: 4096 }}

layer { name: "relu6_1" type: "ReLU" bottom: "fc6_1" top: "fc6_1" }

layer { name: "drop6_1" type: "Dropout" bottom: "fc6_1" top: "fc6_1" dropout_param { dropout_ratio: 0.5 }}

layer { name: "fc7_1" type: "InnerProduct" bottom: "fc6_1" top: "fc7_1"
  	inner_product_param { num_output: 4096 }}

layer { name: "relu7_1" type: "ReLU" bottom: "fc7_1" top: "fc7_1" }

layer { name: "drop7_1" type: "Dropout" bottom: "fc7_1" top: "fc7_1" dropout_param { dropout_ratio: 0.5 }}

#-----------------------------------TWO STREAM----------------------------------------------------------------
layer { name: "fc8c_1" type: "InnerProduct" bottom: "fc7_1" top: "fc8c_1" 
	param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
	inner_product_param { num_output: 20 weight_filler { type: "xavier" } bias_filler { type: "constant" value: 0 }}}
layer { name: "fc8d_1" type: "InnerProduct" bottom: "fc7_1" top: "fc8d_1" 
	param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
	inner_product_param { num_output: 20 weight_filler { type: "xavier" } bias_filler { type: "constant" value: 0 }}}

layer { name: "alpha_cls_1" type: "Softmax" bottom: "fc8c_1" top: "alpha_cls_1" softmax_param { axis: 1 }}
layer { name: "alpha_det_1" type: "Softmax" bottom: "fc8d_1" top: "alpha_det_1" softmax_param { axis: 0 }}

#-----------------------------------COMBINE-------------------------------------------------------------------
layer { name: "bbox_score_1" type: "Eltwise" bottom: "alpha_cls_1" bottom: "alpha_det_1" top: "bbox_score"_1
	eltwise_param { operation: PROD }}

#-----------------------------------POOLING-------------------------------------------------------------------
layer { name: "cls_score" type: "GeneralPooling" bottom: "bbox_score_1" top: "cls_score"
	general_pooling_param { pool: SUM axis: 0 }}

#-----------------------------------CPG-----------------------------------------------------------
layer { name: "mil" type: "MIL" bottom: "cls_score" bottom: "cls_score" bottom: "rois" bottom: "bbox_score_1"
	top: "opg_roi_select"
	cpg_param { is_cpg: false mode: CPG_POOLING is_order: false is_contrast: false debug_info: false
	start_layer_name: "conv1_1" end_layer_name: "cls_score" ignore_label: 20
	opg_blob_name: "data"
#	opg_blob_name: "conv1_2"
#	opg_blob_name: "conv2_2"
#	opg_blob_name: "conv3_3"
#	opg_blob_name: "conv4_3"
#	opg_blob_name: "conv5_3"
	predict_threshold: 0.7 predict_order: 0.0 crf_threshold: 0.95
	mass_threshold: 0.2 density_threshold: 0.0 fg_threshold: 0.1 bg_threshold: 0.001 }}

#-----------------------------------CPG SCORE-----------------------------------------------------------
layer { name: "bbox_prob" type: "Eltwise" bottom: "bbox_score_1" bottom: "opg_roi_select" top: "bbox_prob"
	eltwise_param { operation: PROD }}
